---
kind: property
id: P:Autodesk.Revit.DB.DoubleArray.Size
source: html/4fd03848-9f3e-39e8-f586-c7ff4aa09231.htm
---
# Autodesk.Revit.DB.DoubleArray.Size Property

Returns the number of doubles that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```